logs/password_change.log

2025-11-14 14:44:42 | INFO | auth | [AUTH] URL: https://mail.pxthanh.name.vn/service/soap
2025-11-14 14:44:42 | INFO | auth | [AUTH] XML:
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header>
    <context xmlns="urn:zimbra"/>
  </soap:Header>
  <soap:Body>
    <AuthRequest xmlns="urn:zimbraAccount">
      <account by="name">user06@pxthanh.name.vn</account>
      <password>P@ssvv0rd11</password>
    </AuthRequest>
  </soap:Body>
</soap:Envelope>
2025-11-14 14:44:43 | INFO | auth | [AUTH] Response Status: 200
2025-11-14 14:44:43 | INFO | auth | [AUTH] Response:
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><context xmlns="urn:zimbra"/></soap:Header><soap:Body><AuthResponse xmlns="urn:zimbraAccount"><lifetime>28799999</lifetime><resetPassword>true</resetPassword><authToken>0_8fb378e50445c3fdd0c940b7420d8fdb366903b6_69643d33363a64643637313735642d646630352d343730662d393037652d6264303034663162663037653b6578703d31333a313736333133353038333032393b76763d313a383b747970653d363a7a696d6272613b753d323a72703b7469643d31303a313731363337343039373b76657273696f6e3d31353a31302e312e31315f47415f303432353b</authToken></AuthResponse></soap:Body></soap:Envelope>

2025-11-14 14:44:43 | INFO | auth | authToken: 0_8fb378e50445c3fdd0c940b7420d8fdb366903b6_69643d33363a64643637313735642d646630352d343730662d393037652d6264303034663162663037653b6578703d31333a313736333133353038333032393b76763d313a383b747970653d363a7a696d6272613b753d323a72703b7469643d31303a313731363337343039373b76657273696f6e3d31353a31302e312e31315f47415f303432353b
2025-11-14 14:44:43 | INFO | auth | resetPassword: True
2025-11-14 14:45:14 | INFO | auth | [AUTH] URL: https://mail.pxthanh.name.vn/service/soap
2025-11-14 14:45:14 | INFO | auth | [AUTH] XML:
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header>
    <context xmlns="urn:zimbra"/>
  </soap:Header>
  <soap:Body>
    <AuthRequest xmlns="urn:zimbraAccount">
      <account by="name">user06@pxthanh.name.vn</account>
      <password>P@ssvv0rd11</password>
    </AuthRequest>
  </soap:Body>
</soap:Envelope>
2025-11-14 14:45:14 | INFO | auth | [AUTH] Response Status: 200
2025-11-14 14:45:14 | INFO | auth | [AUTH] Response:
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><context xmlns="urn:zimbra"/></soap:Header><soap:Body><AuthResponse xmlns="urn:zimbraAccount"><lifetime>28799999</lifetime><resetPassword>true</resetPassword><authToken>0_a4219d883821799b738b341bc203406a8b83c818_69643d33363a64643637313735642d646630352d343730662d393037652d6264303034663162663037653b6578703d31333a313736333133353131343834333b76763d313a383b747970653d363a7a696d6272613b753d323a72703b7469643d393a3535303933323135343b76657273696f6e3d31353a31302e312e31315f47415f303432353b</authToken></AuthResponse></soap:Body></soap:Envelope>

2025-11-14 14:45:14 | INFO | auth | authToken: 0_a4219d883821799b738b341bc203406a8b83c818_69643d33363a64643637313735642d646630352d343730662d393037652d6264303034663162663037653b6578703d31333a313736333133353131343834333b76763d313a383b747970653d363a7a696d6272613b753d323a72703b7469643d393a3535303933323135343b76657273696f6e3d31353a31302e312e31315f47415f303432353b
2025-11-14 14:45:14 | INFO | auth | resetPassword: True
2025-11-14 14:46:18 | INFO | auth | [AUTH] URL: https://mail.pxthanh.name.vn/service/soap
2025-11-14 14:46:18 | INFO | auth | [AUTH] XML:
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header>
    <context xmlns="urn:zimbra"/>
  </soap:Header>
  <soap:Body>
    <AuthRequest xmlns="urn:zimbraAccount">
      <account by="name">user06@pxthanh.name.vn</account>
      <password>P@ssvv0rd11</password>
    </AuthRequest>
  </soap:Body>
</soap:Envelope>
2025-11-14 14:46:19 | INFO | auth | [AUTH] Response Status: 200
2025-11-14 14:46:19 | INFO | auth | [AUTH] Response:
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><context xmlns="urn:zimbra"/></soap:Header><soap:Body><AuthResponse xmlns="urn:zimbraAccount"><lifetime>28799993</lifetime><resetPassword>true</resetPassword><authToken>0_94dc3af5f2d0f6c2fa1bedf502c5c2a842ba01d8_69643d33363a64643637313735642d646630352d343730662d393037652d6264303034663162663037653b6578703d31333a313736333133353137393133393b76763d313a383b747970653d363a7a696d6272613b753d323a72703b7469643d393a3735333734333139353b76657273696f6e3d31353a31302e312e31315f47415f303432353b</authToken></AuthResponse></soap:Body></soap:Envelope>

2025-11-14 14:46:19 | INFO | auth | authToken: 0_94dc3af5f2d0f6c2fa1bedf502c5c2a842ba01d8_69643d33363a64643637313735642d646630352d343730662d393037652d6264303034663162663037653b6578703d31333a313736333133353137393133393b76763d313a383b747970653d363a7a696d6272613b753d323a72703b7469643d393a3735333734333139353b76657273696f6e3d31353a31302e312e31315f47415f303432353b
2025-11-14 14:46:19 | INFO | auth | resetPassword: True
2025-11-14 14:46:19 | INFO | auth | [CHANGE_PW] URL: https://mail.pxthanh.name.vn/service/soap
2025-11-14 14:46:19 | INFO | auth | [CHANGE_PW] XML:
<?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
          <soap:Body>
            <ChangePasswordRequest xmlns="urn:zimbraAccount">
              <account by="name">user06@pxthanh.name.vn</account>
              <oldPassword>P@ssvv0rd11</oldPassword>
              <password>P@ssvv0rd12</password>
              <authToken>0_94dc3af5f2d0f6c2fa1bedf502c5c2a842ba01d8_69643d33363a64643637313735642d646630352d343730662d393037652d6264303034663162663037653b6578703d31333a313736333133353137393133393b76763d313a383b747970653d363a7a696d6272613b753d323a72703b7469643d393a3735333734333139353b76657273696f6e3d31353a31302e312e31315f47415f303432353b</authToken>
            </ChangePasswordRequest>
          </soap:Body>
        </soap:Envelope>
2025-11-14 14:46:19 | INFO | auth | [CHANGE_PW] Response Status: 200
2025-11-14 14:46:19 | INFO | auth | [CHANGE_PW] Response:
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><context xmlns="urn:zimbra"/></soap:Header><soap:Body><ChangePasswordResponse xmlns="urn:zimbraAccount"/></soap:Body></soap:Envelope>

2025-11-14 14:46:19 | INFO | auth | Password changed successfully for user06@pxthanh.name.vn
2025-11-14 14:53:14 | INFO | auth | [AUTH] URL: https://mail.pxthanh.gov.vn/service/soap
2025-11-14 14:53:14 | INFO | auth | [AUTH] XML:
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header>
    <context xmlns="urn:zimbra"/>
  </soap:Header>
  <soap:Body>
    <AuthRequest xmlns="urn:zimbraAccount">
      <account by="name">user06@pxthanh.gov.vn</account>
      <password>Mail@123456</password>
    </AuthRequest>
  </soap:Body>
</soap:Envelope>
2025-11-14 14:53:14 | ERROR | auth | HTTP request failed: Cannot connect to host mail.pxthanh.gov.vn:443 ssl:default [getaddrinfo failed]
2025-11-14 14:53:14 | WARNING | views | Failed login attempt: email=user06@pxthanh.gov.vn, ip=127.0.0.1
2025-11-14 14:53:21 | INFO | auth | [AUTH] URL: https://mail.pxthanh.name.vn/service/soap
2025-11-14 14:53:21 | INFO | auth | [AUTH] XML:
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header>
    <context xmlns="urn:zimbra"/>
  </soap:Header>
  <soap:Body>
    <AuthRequest xmlns="urn:zimbraAccount">
      <account by="name">user06@pxthanh.name.vn</account>
      <password>Mail@123456</password>
    </AuthRequest>
  </soap:Body>
</soap:Envelope>
2025-11-14 14:53:21 | INFO | auth | [AUTH] Response Status: 200
2025-11-14 14:53:21 | INFO | auth | [AUTH] Response:
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><context xmlns="urn:zimbra"><change token="328"/></context></soap:Header><soap:Body><AuthResponse xmlns="urn:zimbraAccount"><authToken>0_df8dca1cdd9f8e976ec2db3abd9a11b7a847c103_69643d33363a64643637313735642d646630352d343730662d393037652d6264303034663162663037653b6578703d31333a313736333133353630313838343b76763d323a31323b747970653d363a7a696d6272613b753d313a613b7469643d31303a313438303132313835393b76657273696f6e3d31353a31302e312e31315f47415f303432353b</authToken><lifetime>28799999</lifetime><skin>vnpt1</skin></AuthResponse></soap:Body></soap:Envelope>

2025-11-14 14:53:21 | INFO | auth | authToken: 0_df8dca1cdd9f8e976ec2db3abd9a11b7a847c103_69643d33363a64643637313735642d646630352d343730662d393037652d6264303034663162663037653b6578703d31333a313736333133353630313838343b76763d323a31323b747970653d363a7a696d6272613b753d313a613b7469643d31303a313438303132313835393b76657273696f6e3d31353a31302e312e31315f47415f303432353b
2025-11-14 14:53:21 | INFO | auth | resetPassword: False
2025-11-14 14:53:21 | INFO | views | Successful login: email=user06@pxthanh.name.vn, ip=127.0.0.1, redirect_to=mail.pxthanh.name.vn
2025-11-14 14:53:21 | INFO | views | Redirecting to Zimbra: email=user06@pxthanh.name.vn, hostname=mail.pxthanh.name.vn, ip=127.0.0.1
2025-11-14 14:54:41 | INFO | auth | [AUTH] URL: https://mail.pxthanh.name.vn/service/soap
2025-11-14 14:54:41 | INFO | auth | [AUTH] XML:
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header>
    <context xmlns="urn:zimbra"/>
  </soap:Header>
  <soap:Body>
    <AuthRequest xmlns="urn:zimbraAccount">
      <account by="name">user06@pxthanh.name.vn</account>
      <password>Mail@123456</password>
    </AuthRequest>
  </soap:Body>
</soap:Envelope>
2025-11-14 14:54:41 | INFO | auth | [AUTH] Response Status: 200
2025-11-14 14:54:41 | INFO | auth | [AUTH] Response:
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><context xmlns="urn:zimbra"><change token="328"/></context></soap:Header><soap:Body><AuthResponse xmlns="urn:zimbraAccount"><authToken>0_8e04bafb197efe082dc25cc69655fe5d46af66f9_69643d33363a64643637313735642d646630352d343730662d393037652d6264303034663162663037653b6578703d31333a313736333133353638313639353b76763d323a31323b747970653d363a7a696d6272613b753d313a613b7469643d393a3836373738353538383b76657273696f6e3d31353a31302e312e31315f47415f303432353b</authToken><lifetime>28799999</lifetime><skin>vnpt1</skin></AuthResponse></soap:Body></soap:Envelope>

2025-11-14 14:54:41 | INFO | auth | authToken: 0_8e04bafb197efe082dc25cc69655fe5d46af66f9_69643d33363a64643637313735642d646630352d343730662d393037652d6264303034663162663037653b6578703d31333a313736333133353638313639353b76763d323a31323b747970653d363a7a696d6272613b753d313a613b7469643d393a3836373738353538383b76657273696f6e3d31353a31302e312e31315f47415f303432353b
2025-11-14 14:54:41 | INFO | auth | resetPassword: False
2025-11-14 14:54:41 | INFO | views | Successful login: email=user06@pxthanh.name.vn, ip=127.0.0.1, redirect_to=mail.pxthanh.name.vn
2025-11-14 14:54:42 | INFO | views | Redirecting to Zimbra: email=user06@pxthanh.name.vn, hostname=mail.pxthanh.name.vn, ip=127.0.0.1
